def question1():
    print("សំណួរទី​១ :")
    print("* តើសិល្បៈខ្មែរចែកជាប៉ុន្មានរចនាបថ? ")
    print ("ក. ១០")
    print ("ខ. ១៣ ")
    print ("គ. ១៤ ")
    option_1 = input("សូមជ្រើសរើសចម្លើយ (ក - គ): ")
    match option_1:
        case "គ":
            print(f"ចម្លើយ : {option_1} គឹជាចម្លើយត្រឹមត្រូវ = 20 ពិន្ទុ")
            return 20
        case _:
            print("ចម្លើយមិនត្រូវត្រូវ = 0 ពិន្ទុ")
            return 0

    print("")

def question2():
    print("សំណួរទី​ ២ :")
    print("* តើប្រទេសកម្ពុជាប្រកាន់យកសាសនាអ្វីជាផ្លូវការនាបច្ចុប្បន្ននេះ? ")
    print ("ក. ពុទ្ធសាសនា")
    print ("ខ. សាសនាឥស្លាម ")
    print ("គ. សាសនាព្រាហ្មណ៍ ")      
    option_2 = input("សូមជ្រើសរើសចម្លើយ (ក-គ): ")        
    match option_2:
        case "ក":
            print(f"ចម្លើយ : {option_2} គឹជាចម្លើយត្រឹមត្រូវ = 20 ពិន្ទុ")
            return 20
        case _:
            print("ចម្លើយមិនត្រូវត្រូវ = 0 ពិន្ទុ")
            return 0

    print("")

def question3():
    print("សំណួរទី​ ៣​ :")
    print("* តើកម្ពុជាទទួលបានឯករាជ្យពីអាណាព្យាបាលបារាំងនៅឆ្នាំណា?")
    print ( " ក. ឆ្នាំ ១៩៤៥ " )
    print ( " ខ. ឆ្នាំ ១៩៥៣ " )
    print ( " គ. ឆ្នាំ​ ១៩៦៣ " )
    option_3 = input("សូមជ្រើសរើសចម្លើយ (ក-គ): ")        
    match option_3:
        case "ខ":
            print(f"ចម្លើយ : {option_3} គឹជាចម្លើយត្រឹមត្រូវ = 20 ពិន្ទុ")
            return 20
        case _:
            print("ចម្លើយមិនត្រូវត្រូវ = 0 ពិន្ទុ")
            return 0

    print ("")
def question4():
    print("សំណួរទី​ ៤​ :")
    print("* តើប្រព័ន្ធគមនាគមន៍ផ្លូវទឹកនៅអង្គរមានប៉ុន្មាន?")
    print ( " ក. ១ " )
    print ( " ខ. ២ " )
    print ( " គ. ៣ " )
    option_4 = input("សូមជ្រើសរើសចម្លើយ (ក-គ): ")        
    match option_4:
        case "ខ":
            print(f"ចម្លើយ : {option_4} គឹជាចម្លើយត្រឹមត្រូវ = 20 ពិន្ទុ")
            return 20
        case _:
            print("ចម្លើយមិនត្រូវត្រូវ = 0 ពិន្ទុ")
            return 0

    print ("")

def question5 ():
    print("សំណួរទី​ ៥​ :")
    print("* តើមរតកវប្បធម៌ ឬបេតិកភណ្ខវប្បធម៌ចែកចេញជាប៉ុន្មាន? អ្វីខ្លះ?")

    print ( " ក. ចែកចេញជា ២ គឺ បេតិកភណ្ខវប្បធម៌ធម្មជាតិ និងបេតិកភណ្ខវប្បធម៌រូបី " )
    print ( " ខ. ចែកចេញជា ៣ គឺ បេតិកភណ្ខវប្បធម៌ធម្មជាតិ បេតិកភណ្ខវប្បធម៌រូបី និងបេតិកភណ្ខវប្បធម៌អរូបី " )
    print ( " គ. ចែកចេញជា ២ គឺ បេតិកភណ្ខវប្បធម៌រូបី និងបេតិកភណ្ខវប្បធម៌អរូបី " )
    option_5 = input("សូមជ្រើសរើសចម្លើយ (ក-គ): ")        
    match option_5:
        case "គ":
            print(f"ចម្លើយ : {option_5} គឹជាចម្លើយត្រឹមត្រូវ = 20 ពិន្ទុ")
            return 20
        case _:
            print("ចម្លើយមិនត្រូវត្រូវ = 0 ពិន្ទុ")
            return 0
